 
                              IC Compiler II (TM)

             Version T-2022.03-SP4 for linux64 - Aug 31, 2022 -SLE

                    Copyright (c) 1988 - 2022 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)

Loading user preference file /home1/PD07/AMuthuKKumar/.synopsys_icc2_gui/preferences.tcl
Warning: Cannot use command line editor for terminal type 'xterm-256color'. (CLE-100)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14rvt_ss0p6v125c', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library 'fpu_add.dlib'. Please run derive_design_level_via_regions to generate up-do-date via region in the design library. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14lvt_ss0p6v125c', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library 'fpu_add.dlib'. Please run derive_design_level_via_regions to generate up-do-date via region in the design library. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14rvt_ss0p6v_c_physical_only', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library 'fpu_add.dlib'. Please run derive_design_level_via_regions to generate up-do-date via region in the design library. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14lvt_ss0p6v_c_physical_only', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library 'fpu_add.dlib'. Please run derive_design_level_via_regions to generate up-do-date via region in the design library. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'EXPLORE_physical_only', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library 'fpu_add.dlib'. Please run derive_design_level_via_regions to generate up-do-date via region in the design library. (NDM-102)
icc2_shell> open_block /home1/PD07/AMuthuKKumar/FPU/fpu_add/ICCII/work/fpu_add.dlib:fpu_add/floorplan.design
Information: User units loaded from library 'saed14rvt_ss0p6v125c' (LNK-040)
Opening block 'fpu_add.dlib:fpu_add/floorplan.design' in edit mode
icc2_shell> link_block
Using libraries: fpu_add.dlib saed14rvt_ss0p6v125c saed14lvt_ss0p6v125c saed14rvt_ss0p6v_c_physical_only saed14lvt_ss0p6v_c_physical_only EXPLORE_physical_only
Visiting block fpu_add.dlib:fpu_add/floorplan.design
Information: default_pst (one pst_state with all possible port_state/power_state for all supplies) has been applied to the design since there is no PST/power_state_group created in top scope. (UPF-371)
Design 'fpu_add' was successfully linked.
1
icc2_shell> report_layers
Error: unknown command 'report_layers' (CMD-005)
icc2_shell> current_design -quiet
{fpu_add.dlib:fpu_add/floorplan.design}
icc2_shell> report_ignored_layers -verbose
****************************************
Report : Ignored Layers
Design : fpu_add
Version: T-2022.03-SP4
Date   : Thu Sep 18 03:24:46 2025
****************************************
Layer Attribute                 Value
--------------------------------------------------------------------------------
Min Routing Layer               (none given)
Max Routing Layer               (none given)
RC Estimation Ignored Layers    (none given)
1
icc2_shell> report_ignored_layers
****************************************
Report : Ignored Layers
Design : fpu_add
Version: T-2022.03-SP4
Date   : Thu Sep 18 03:24:58 2025
****************************************
Layer Attribute                 Value
--------------------------------------------------------------------------------
Min Routing Layer               (none given)
Max Routing Layer               (none given)
RC Estimation Ignored Layers    (none given)
1
icc2_shell> 
create_pg_ring_pattern ring_pattern -horizontal_layer M8 \
   -horizontal_width {1} -horizontal_spacing {0.5} \
   -vertical_layer M7 -vertical_width {1} -vertical_spacing {0.5}Successfully create PG ring pattern ring_pattern.
set_pg_strategy core_ring \
   -pattern {{name: ring_pattern} \
   {nets: {VDD VSS}} {spacings:overleaving} {offset: {0.1 0.1}}} -core
Error: In the pattern expression {name: ring_pattern}  {nets: {VDD VSS}} {spacings:overleaving} {offset: {0.1 0.1}}, the specified string spacings:overleaving is unknown. (PGR-006)
Error: For option -pattern, the specified value {name: ring_pattern}  {nets: {VDD VSS}} {spacings:overleaving} {offset: {0.1 0.1}} is invalid. (PGR-002)
Fail to set PG strategy core_ring.
Information: script '/tmp/icc2_shell-2.QVvsOL'
                stopped at line 1 due to error. (CMD-081)
Extended error info:

    while executing
"set_pg_strategy core_ring \
   -pattern {{name: ring_pattern} \
   {nets: {VDD VSS}} {spacings:overleaving} {offset: {0.1 0.1}}} -core"
    (file "/tmp/icc2_shell-2.QVvsOL" line 1)
 -- End Extended Error Info
icc2_shell> gui_show_man_page set_pg_strategy
icc2_shell> 
set_pg_strategy core_ring \
   -pattern {{name: ring_pattern} \
   {nets: {VDD VSS}}  {offset: {0.1 0.1}}} -coreSuccessfully set PG strategy core_ring.
compile_pg -strategies core_ringSanity check for inputs.
No strategy-level via rule is specified, the default rule will be applied.
Automatic PG net connection through connect_pg_net is disabled.
Updating PG strategies.
Updating strategy core_ring.
Loading library and design information.
Number of Standard Cells: 0
Number of Hard Macros: 0
Number of Pads: 0
Creating rings.
Creating via connection between strategies and existing shapes.
Via DRC checking runtime 0.00 seconds.
via connection runtime: 0 seconds.
Removing dangling/floating wire/vias after DRC check.
Start iteration 1:
Checking potential dangling/floating power plan wires.
Checking dangling/floating vias inside strategy core_ring.
Checking 8 stacked vias:0% 10% 20% 30% 50% 60% 70% 80% 100%
Finish removing all dangling or floating wires and vias.
Commiting wires and vias.
Committed 8 wires.
Committing wires takes 0.00 seconds.
Committed 8 vias.
Committed 0 wires for via creation.
Committing vias takes 0.00 seconds.
Overall PG creation runtime: 0 seconds.
Successfully compiled PG.
Overall runtime: 0 seconds.
1
icc2_shell> remove_pg_patterns
Please specify pattern name to be removed.
icc2_shell> 